{"scoring":null,"notes":"","legend":"Домашний питомец мальчика Васи - улитка Петя. Петя обитает на бесконечном в обе стороны столбе, представляющим собой числовую прямую. Изначально Петя находится в точке 0.\r\n\r\nВася кормит Петю ягодами. У него есть $n$ различных ягод, каждая в единственном экземпляре.\r\nВася знает, что если в $i$ день он даст Пете $i$ ягоду, то поев и набравшись сил, за остаток дня Петя поднимется на $a_i$ единиц ввверх по столбу, но при этом за ночь, потяжелев, съедет на $b_i$ единиц вниз.\r\n\r\nПете стало интересно, а как оно там, наверху, и Вася взялся ему в этом помочь. Ближайшие $n$ дней он будет кормить Петю ягодами из своего запаса таким образом, чтобы максимальная высота, на которой побывал Петя за эти $n$ дней была максимальной. К сожалению, Вася не умеет программировать, поэтому он попросил вас о помощи. Найдите, максимальную высоту, на которой Петя сможет побывать за эти $n$ дней и каким образом Вася должен его кормить, чтобы Петя смог её достичь!","authorLogin":"LordVoldebug","language":"russian","timeLimit":1000,"output":"В первой строке выходных данных выведите единственное число - максимальную высоту, которую сможет достичь Петя, если Вася будет его кормить оптимальным образом.\r\nВ следующей строке выведите $n$ различных целых чисел от $1$ до $n$ - порядок, в котором Вася должен кормить Петю ($i$ число в строке соответствует номеру ягоды, которую Вася должен дать Пете в $i$ день чтобы Петя смог достичь максимальной высоты).","inputFile":"stdin","outputFile":"stdout","input":"В первой строке входных данных дано число $n$ ($1 \\le n \\le 5 * 10 ^ 5$)  - количество ягод у Васи.\r\nВ последующих $n$ строках описываются параметры каждой ягоды. \r\nВ $i + 1$ строке дано два числа $a_i$ и $b_i$  ($0 \\le a_i, b_i \\le 10 ^ 9$) - то, насколько поднимется улитка за день после того, как съест $i$ ягоду и насколько опуститься за ночь.","authorName":"Vladimir Kaurkin","sampleTests":[{"output":"10\r\n2 3 1 \r\n","input":"3\r\n1 5\r\n8 2\r\n4 4\r\n","inputFile":"example.01","outputFile":"example.01.a"}],"name":"Амбициозная улитка","interaction":null,"memoryLimit":268435456,"tutorial":""}